Revit 2027 API
FabricationPart.SetPositionByEnd Method
 Positions the connector of the fabrication part element by the passed point.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetPositionByEnd(
	Connector connector,
	XYZ position
)
Public Sub SetPositionByEnd (
	connector As Connector,
	position As XYZ
)
public:
void SetPositionByEnd(
	Connector^ connector,
	XYZ^ position
)
member SetPositionByEnd :
        connector : Connector *
        position : XYZ -> unit
Parameters
connector Connector
 The connector of the fabrication part element.
position XYZ
 The position to move to.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  this operation failed.
See Also
Reference
FabricationPart Class
Autodesk.Revit.DB Namespace